#include "./libs/ANN_lib_settings.h"

int 
main(int argc, char *argv[]) {
/*[BLOCK: Объявление переменных]--------------------------------------------->*/

	Settings_t settings;

/*<---------------------------------------------[BLOCK: Объявление переменных]*/
/*[BLOCK: Инициализация таблицы настроек]------------------------------------>*/

	get_settings(&settings);

/*<------------------------------------[BLOCK: Инициализация таблицы настроек]*/
/*[BLOCK: Создание и запись таблицы настроек в файл settings.h]-------------->*/

	set_settings(&settings);

/*<--------------[BLOCK: Создание и запись таблицы настроек в файл settings.h]*/
/*[BLOCK: Освобождение памяти]----------------------------------------------->*/

	free_obj(&settings);

/*<-----------------------------------------------[BLOCK: Освобождение памяти]*/
/*[BLOCK: Запуск процесса построителя графа]--------------------------------->*/

	printf("Settings are ready. Do you want to start a graph-builder? [y/n]\n");
	if (getchar() == 'y') {
		run_mkgraph();
	}

/*<---------------------------------[BLOCK: Запуск процесса построителя графа]*/
	exit(EXIT_SUCCESS);
}