#include "./ANN_lib_settings.h"
#include "./ANN_lib_graph.h"

char *functions[] = {
	"abs",		/* Вычисление абсолютной величины целого числа */
	"acos",		/* Арккосинус */
	"asin",		/* Арксинус */
	"atan",		/* Арктангенс */
	"ceil",		/* Округление до ближайшего большего целого числа */
	"cos",		/* Косинус */
	"exp",		/* Экспонента */
	"fabs",		/* Абсолютная величина */
	"fmod",		/* Вычисление остатка от деления нацело для чисел с плавающей точкой */
	"ldexp",	/* Умножение числа с плавающей точкой на целую степень двух */
	"log",		/* Натуральный логарифм */
	"log10",	/* Логарифм по основанию 10 */
	"sin",		/* Синус */
	"sinh",		/* Гиперболический синус */
	"cosh",		/* Гиперболический косинус */
	"sqrt",		/* Квадратный корень */
	"tan",		/* Тангенс */
	"tanh",		/* Гиперболический тангенс */
	NULL
};
